package FirstExampleParsing.window.helper_classes;

public class Info {

    public Info() {
        String info = "Данный проект разработан для работы с прайсом exl\n" +
                "Используется:\n" +
                "- csv\n" +
                "- exl\n" +
                "- swing\n" +
                "\n" +
                "Подготовка перед запуском проекта:\n" +
                "нам нужно получить csv файл, содержащий 4 столбца " +
                "(название товара, артикул, цена, количество).\n" +
                "Получается при разборе с сайта SP39.ru.\n" +
                "\n" +
                "Далее запускаем программу.\n" +
                "\n" +
                "Откроется окно выбора файла.\n" +
                "Вы должны выбрать CSV и EXL файлы . Далее программа будет " +
                "работать в автономном режиме.\n" +
                "\n" +
                "за каждый недобавленный продукт, он генерирует отчет.\n" +
                "Отчет содержит название продукта и возникшую ошибку." +
                "\n" +
                "По окончании программы откроется окно\n" +
                " с надписью «Успешно».\n" +
                "\n" +
                "Файл отчета появится в папке «Загрузки».\n" +
                "Выглядит это так:\n" +
                "No_Find_Seeds_05_05_2023.xls.\n" +
                "Price_05_05_2023.xls\n";
        System.out.println(info);

    }
}
